const express = require('express');
const router = express.Router();

const stationsList = [
	{
		id: 1,
		name: '府中駅',
		lat: '35.6721388',
		lng: '139.4800546'
	},
	{
		id: 2,
		name: '東府中駅',
		lat: '35.669406',
		lng: '139.494961'
	},
	{
		id: 3,
		name: '多磨霊園駅',
		lat: '35.666102',
		lng: '139.503337'
	},
	{
		id: 4,
		name: '武蔵野台駅',
		lat: '35.663956',
		lng: '139.510982'
	},
	{
		id: 5,
		name: '中河原駅',
		lat: '35.659772',
		lng: '139.457719'
	},
	{
		id: 6,
		name: '府中競馬正門前駅',
		lat: '35.668034',
		lng: '139.484655'
	},
	{
		id: 7,
		name: '分倍河原駅',
		lat: '35.668704',
		lng: '139.468912'
	},
	{
		id: 8,
		name: '府中本町駅',
		lat: '35.666566',
		lng: '139.477030'
	},
	{
		id: 9,
		name: '西府駅',
		lat: '35.671131',
		lng: '139.457569'
	},
	{
		id: 10,
		name: '北府中駅',
		lat: '35.680763',
		lng: '139.472015'
	},
	{
		id: 11,
		name: '多磨駅',
		lat: '35.676552',
		lng: '139.517336'
	},
	{
		id: 12,
		name: '白糸台駅',
		lat: '35.666673',
		lng: '139.509355'
	},
	{
		id: 13,
		name: '競艇場前駅',
		lat: '35.655867',
		lng: '139.499574'
	},
	{
		id: 14,
		name: '是政駅',
		lat: '35.656430',
		lng: '139.488721'
	}
];

const karutaList = [
	{
		id: 1,
		kana: "い",
		name: "いちばんはじめに武蔵の国府",
		location: "坪の宮鳥居の右側",
		address: "府中市本町2-12",
		lat: "35.667386",
		lng: "139.473783"
	},
	{
		id: 2,
		kana: "い",
		name: "いちばんはじめに武蔵の国府",
		location: "武蔵国衙跡南側入り口",
		address: "府中市宮町2-5",
		lat: "35.668847",
		lng: "139.479769"
	},
	{
		id: 3,
		kana: "ろ",
		name: "六所明神武蔵の総社",
		location: "大国魂神社随神門の側",
		address: "府中市宮町3-1",
		lat: "35.668285",
		lng: "139.478932"
	},
	{
		id: 4,
		kana: "は",
		name: "馬場大門の馬の市",
		location: "けやき並木・居酒屋マエ・「る」の裏面",
		address: "府中市宮町1-2",
		lat: "35.671706",
		lng: "139.479211"
	},
	{
		id: 5,
		kana: "に",
		name: "二千年蓮の大賀博士",
		location: "寿中央公園ハス池の東側の芝生内",
		address: "府中市寿町2-7",
		lat: "35.674722",
		lng: "139.477026"
	},
	{
		id: 6,
		kana: "に",
		name: "二千年蓮の大賀博士",
		location: "郷土の森公園修景池の南のほとり",
		address: "府中市矢崎町５",
		lat: "35.655611",
		lng: "139.47581"
	},
	{
		id: 7,
		kana: "ほ",
		name: "北条と新田の分倍古戦場",
		location: "新田川緑道分梅橋東・分倍河原古戦場記念碑マエ",
		address: "府中市分梅町２",
		lat: "35.663281",
		lng: "139.463416"
	},
	{
		id: 8,
		kana: "へ",
		name: "平地と台地はけの道",
		location: "滝神社の上を通る道から神社へおりる石段の右側",
		address: "府中市清水が丘2-37",
		lat: "35.665845",
		lng: "139.49481"
	},
	{
		id: 9,
		kana: "と",
		name: "虎の朱印は免税状",
		location: "高安寺本堂手前の鐘楼の下",
		address: "府中市片町2-4",
		lat: "35.669401",
		lng: "139.47243"
	},
	{
		id: 10,
		kana: "ち",
		name: "地名にのこる井田是政",
		location: "八幡神社鳥居の右側（是政の墓は東京競馬場内にある）",
		address: "府中市是政三丁目20-3",
		lat: "35.659225",
		lng: "139.488208"
	},
	{
		id: 11,
		kana: "り",
		name: "良雪えがく水墨画",
		location: "妙光院山門へ向かう通りの中程左側（良雪の墓は標識の左オク）",
		address: "府中市本町1-16",
		lat: "35.665683",
		lng: "139.479414"
	},
	{
		id: 12,
		kana: "ぬ",
		name: "布をさらして白糸・染屋",
		location: "神明神社境内（神社の右隣りに観音院がある）",
		address: "府中市白糸台三丁目10-2",
		lat: "35.666128",
		lng: "139.515253"
	},
	{
		id: 13,
		kana: "る",
		name: "類のないけやきのなみ木",
		location: "けやき並木・居酒屋マエ・「は」の裏面",
		address: "府中市宮町1-2",
		lat: "35.671706",
		lng: "139.479211"
	},
	{
		id: 14,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "都立武蔵野公園梅園の南側",
		address: "府中市多磨町三丁目2-31",
		lat: "35.688349",
		lng: "139.518277"
	},
	{
		id: 15,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "武蔵台公園内・市立府中第七中学校体育館北側の雑木林",
		address: "府中市武蔵台２",
		lat: "35.690027",
		lng: "139.462756"
	},
	{
		id: 16,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "本願寺山門右側",
		address: "府中市白糸台5-20",
		lat: "35.662903",
		lng: "139.512695"
	},
	{
		id: 17,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "高安寺南東のハケ道",
		address: "府中市片町2-28",
		lat: "35.668954",
		lng: "139.473341"
	},
	{
		id: 18,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "西府文化センター南西の植込みの中",
		address: "府中市西府町一丁目9-9",
		lat: "35.670852",
		lng: "139.455972"
	},
	{
		id: 19,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "多摩川かぜのみちワキの五本松",
		address: "府中市四谷５",
		lat: "35.665602",
		lng: "139.436346"
	},
	{
		id: 20,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "旧郷土館〔現ふるさと府中歴史 館〕西側の植込みの中",
		address: "府中市宮町3-1",
		lat: "35.668926",
		lng: "139.4785"
	},
	{
		id: 21,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "浅間山の中・浅間山と中山の中間の小道",
		address: "府中市若松町5-20",
		lat: "35.680592",
		lng: "139.501225"
	},
	{
		id: 22,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "多磨霊園正門右手前の植込みの中・多磨駐在所左手",
		address: "府中市多磨町４",
		lat: "35.678054",
		lng: "139.513404"
	},
	{
		id: 23,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "滝神社の上を通る道から神社へおりる石段の左側",
		address: "府中市清水が丘2-37",
		lat: "35.665845",
		lng: "139.49481"
	},
	{
		id: 24,
		kana: "を",
		name: "自然をまもって住みよいまちに",
		location: "多摩川かぜのみち上で是政堰の北側の堤",
		address: "府中市是政６",
		lat: "35.653873",
		lng: "139.47767"
	},
	{
		id: 25,
		kana: "わ",
		name: "和算の学者関孝和",
		location: "大国魂神社随神門の左側",
		address: "府中市宮町3-1",
		lat: "35.668269",
		lng: "139.479109"
	},
	{
		id: 26,
		kana: "か",
		name: "街道まじわる高札場",
		location: "高札場（高札場は旧甲州街道と府中街道の交差点にある）",
		address: "府中市宮西町5-4",
		lat: "35.669887",
		lng: "139.476676"
	},
	{
		id: 27,
		kana: "よ",
		name: "横山党の懸け仏",
		location: "鹿島神社鳥居の右側（神社は府中街道沿いの西蔵院のウラ）",
		address: "府中市是政3-35",
		lat: "35.658761",
		lng: "139.485194"
	},
	{
		id: 28,
		kana: "た",
		name: "田畑しらべた検地帳",
		location: "郷土の森博物館入り口、発券所の左側",
		address: "府中市南町6-32",
		lat: "35.656151",
		lng: "139.473776"
	},
	{
		id: 29,
		kana: "れ",
		name: "歴史がねむる公園墓地",
		location: "多磨霊園正門右手前の植込みの中・多磨駐在所左手",
		address: "府中市多磨町４",
		lat: "35.678054",
		lng: "139.513404"
	},
	{
		id: 30,
		kana: "そ",
		name: "そら行けみんなで健康センター",
		location: "郷土の森総合体育館（旧健康センター）北側の植込みの中",
		address: "府中市矢崎町五丁目11-9",
		lat: "35.656267",
		lng: "139.477583"
	},
	{
		id: 31,
		kana: "つ",
		name: "つり人に夕日が赤い向山",
		location: "多摩川かぜのみち上で是政堰の北側の堤",
		address: "府中市是政６",
		lat: "35.653873",
		lng: "139.47767"
	},
	{
		id: 32,
		kana: "ね",
		name: "音色さやかな蓮華の磬",
		location: "妙光院門入り口の左側",
		address: "府中市本町1-16",
		lat: "35.665652",
		lng: "139.47897"
	},
	{
		id: 33,
		kana: "な",
		name: "七百余年の歴史の板碑",
		location: "八雲神社北側にある古木に抱かれた板碑の右側",
		address: "府中市美好町3-40",
		lat: "35.668364",
		lng: "139.464972"
	},
	{
		id: 34,
		kana: "ら",
		name: "ランプやあんどん郷土館",
		location: "旧郷土館〔現ふるさと府中歴史館〕北側の植込みの中",
		address: "府中市宮町3-1",
		lat: "35.668815",
		lng: "139.47887"
	},
	{
		id: 35,
		kana: "む",
		name: "むさしのきすげは五月のかおり",
		location: "浅間山の中・浅間山と中山の中間の小道",
		address: "府中市若松町5-20",
		lat: "35.680592",
		lng: "139.501225"
	},
	{
		id: 36,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "都立武蔵野公園正門オクの植込みの中",
		address: "府中市多磨町三丁目2-31",
		lat: "35.688349",
		lng: "139.518277"
	},
	{
		id: 37,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "武蔵台公園内・市立府中第七中学校体育館北側の雑木林",
		address: "府中市武蔵台２",
		lat: "35.690027",
		lng: "139.462756"
	},
	{
		id: 38,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "本願寺山門右側",
		address: "府中市白糸台5-20",
		lat: "35.662903",
		lng: "139.512695"
	},
	{
		id: 39,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "高安寺南東のハケ道",
		address: "府中市片町2-28",
		lat: "35.668954",
		lng: "139.473341"
	},
	{
		id: 40,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "西府文化センター南西の植込みの中",
		address: "府中市西府町1-10",
		lat: "35.670852",
		lng: "139.455972"
	},
	{
		id: 41,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "多摩川かぜのみちワキの五本松",
		address: "府中市四谷５",
		lat: "35.665602",
		lng: "139.436346"
	},
	{
		id: 42,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "旧郷土館〔現ふるさと府中歴史館〕西側の植込みの中",
		address: "府中市宮町3-1",
		lat: "35.668926",
		lng: "139.4785"
	},
	{
		id: 43,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "寿中央公園ハス池の東側の芝生内",
		address: "府中市寿町2-7",
		lat: "35.674722",
		lng: "139.477026"
	},
	{
		id: 44,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "郷土の森公園修景池の南のほとり",
		address: "府中市矢崎町５",
		lat: "35.655611",
		lng: "139.47581"
	},
	{
		id: 45,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "浅間山山頂にある浅間神社の右側",
		address: "府中市若松町5-20",
		lat: "35.681177",
		lng: "139.502417"
	},
	{
		id: 46,
		kana: "う",
		name: "うめにひばりに木はけやき",
		location: "郷土の森博物館入り口、発券所の左側",
		address: "府中市南町6-32",
		lat: "35.656151",
		lng: "139.473776"
	},
	{
		id: 47,
		kana: "の",
		name: "野村瓜州の「四人部屋」",
		location: "旧甲州街道沿いの中華料理店マエ（瓜州の墓は高安寺にある）",
		address: "府中市宮西町2-8",
		lat: "35.670029",
		lng: "139.47763"
	},
	{
		id: 48,
		kana: "お",
		name: "大きな塚の高倉遺跡",
		location: "光明院北側の高倉塚内",
		address: "府中市分梅町1-11",
		lat: "35.667552",
		lng: "139.4659"
	},
	{
		id: 49,
		kana: "く",
		name: "黒馬まっさきどよめく競馬",
		location: "東京競馬場正門入口東側の植込みの中",
		address: "府中市日吉町１",
		lat: "35.666845",
		lng: "139.48572"
	},
	{
		id: 50,
		kana: "や",
		name: "八つのみこしに大太鼓",
		location: "大国魂神社随神門の右側",
		address: "府中市宮町3-1",
		lat: "35.668268",
		lng: "139.479107"
	},
	{
		id: 51,
		kana: "ま",
		name: "松を立てない正月飾り",
		location: "旧甲州街道沿いの国府八幡神社鳥居の左手前",
		address: "府中市八幡町2-29",
		lat: "35.669582",
		lng: "139.489227"
	},
	{
		id: 52,
		kana: "け",
		name: "京王線は大正五年",
		location: "京王線府中駅北口広場",
		address: "府中市府中町１",
		lat: "35.6724624",
		lng: "139.4800571"
	},
	{
		id: 53,
		kana: "ふ",
		name: "府中ばやしの笛太鼓",
		location: "大国魂神社随神門の左側",
		address: "府中市宮町3-1",
		lat: "35.668267",
		lng: "139.479106"
	},
	{
		id: 54,
		kana: "こ",
		name: "甲州街道府中宿",
		location: "旧甲州街道と府中街道の交差点付近・御旅所の道向い",
		address: "府中市宮西町４",
		lat: "35.669983",
		lng: "139.476724"
	},
	{
		id: 55,
		kana: "え",
		name: "えのきが高い三千人塚",
		location: "三千人塚に立つ板碑の左側（塚の前の道は鎌倉古街道）",
		address: "府中市矢崎町2-21",
		lat: "35.662729",
		lng: "139.475181"
	},
	{
		id: 56,
		kana: "て",
		name: "鉄の仏の善明寺",
		location: "善明寺山門の右側（鉄仏は山門入って右側の金仏殿の中）",
		address: "府中市本町一丁目5-17",
		lat: "35.668061",
		lng: "139.476215"
	},
	{
		id: 57,
		kana: "あ",
		name: "朝鳴るかねは高安寺",
		location: "高安寺本堂手前の鐘楼の下",
		address: "府中市片町2-4",
		lat: "35.669401",
		lng: "139.47243"
	},
	{
		id: 58,
		kana: "さ",
		name: "さいしょの代官高林吉利",
		location: "高安寺墓地内の吉利の墓のヨコ",
		address: "府中市片町2-4",
		lat: "35.66926",
		lng: "139.47274"
	},
	{
		id: 59,
		kana: "き",
		name: "ききん救った平右衛門",
		location: "竜光寺入口（平右衛門の墓は本堂ウラの墓地の中にある）",
		address: "府中市押立町4-35",
		lat: "35.653763",
		lng: "139.518677"
	},
	{
		id: 60,
		kana: "ゆ",
		name: "ゆたかな姿のあみださま",
		location: "染屋不動境内の阿弥陀仏安置堂の左側",
		address: "府中市白糸台1-11",
		lat: "35.66818",
		lng: "139.50778"
	},
	{
		id: 61,
		kana: "め",
		name: "明治六年学舎はひらけ",
		location: "市立府中第一小学校正門の左側",
		address: "府中市寿町2-6",
		lat: "35.673617",
		lng: "139.477736"
	},
	{
		id: 62,
		kana: "め",
		name: "明治六年学舎はひらけ",
		location: "市立府中第四小学校正門の右側",
		address: "府中市白糸台1-58",
		lat: "35.666246",
		lng: "139.507879"
	},
	{
		id: 63,
		kana: "め",
		name: "明治六年学舎はひらけ",
		location: "市立府中第五小学校正門の左側",
		address: "府中市本宿町1-36",
		lat: "35.669435",
		lng: "139.458832"
	},
	{
		id: 64,
		kana: "み",
		name: "宮のまもりの狛犬一対",
		location: "大国魂神社随神門の右側",
		address: "府中市宮町3-1",
		lat: "35.668276",
		lng: "139.479081"
	},
	{
		id: 65,
		kana: "し",
		name: "しながわ道の一里塚",
		location: "品川街道沿いの一里塚祈念碑のマエ",
		address: "府中市清水が丘3-15",
		lat: "35.66775",
		lng: "139.500681"
	},
	{
		id: 66,
		kana: "ひ",
		name: "人見の合戦花絵巻",
		location: "浅間神社登り口の鳥居の左側（古戦場は浅間山の周辺）",
		address: "府中市若松町5-20",
		lat: "35.680454",
		lng: "139.503129"
	},
	{
		id: 67,
		kana: "も",
		name: "もえる若葉の浅間山",
		location: "浅間山山頂にある浅間神社の右側",
		address: "府中市若松町5-20",
		lat: "35.681177",
		lng: "139.502417"
	},
	{
		id: 68,
		kana: "せ",
		name: "関戸をわたる鎌倉街道",
		location: "関戸橋左の多摩川堤・堤から河原におりる石段の右側",
		address: "府中市住吉町２",
		lat: "35.654987",
		lng: "139.456478"
	},
	{
		id: 69,
		kana: "す",
		name: "すえ器が片町たてあな住居",
		location: "旧甲州街道の弁慶橋から梅並木へ入った角の植込みの中",
		address: "府中市片町2-11",
		lat: "35.670087",
		lng: "139.470486"
	},
	{
		id: 70,
		kana: "ん",
		name: "天正のひびき人見の鰐口",
		location: "人見街道沿いの人見研修所マエの鳥居近く",
		address: "府中市若松町4-21",
		lat: "35.675504",
		lng: "139.504337"
	}
];

router.get('/', function(req, res, next) {
	res.render('index', {
		title: '府中かるたさんぽ',
		stationsList: stationsList,
		karutaList: karutaList
	});
});

module.exports = router;
